In [231]:
import pandas as pd
import numpy as np

# Loading the dataset

In [242]:
df=pd.read_csv('Titanic-Dataset.csv')

In [243]:
df.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

# Handling Null Values

In [244]:
#TODO - Check for null values (1 line)
#df.info() 
print(df.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [245]:
#TODO - Fill null values for 'Embarked' with the mode(1 line)

df['Embarked'].fillna(df['Embarked'].mode().iloc[0],inplace=True)
df['Embarked'].isnull().sum()
#df['Embarked'].replace(df['Embarked'].isnull(),df['Embarked'].mode().iloc[0] ,inplace=True)

C:\Users\anees\AppData\Local\Temp\ipykernel_21152\1072715658.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Embarked'].fillna(df['Embarked'].mode().iloc[0],inplace=True)

np.int64(0)

In [248]:
#TODO - Drop rows with null values in 'Cabin' (or alternatively, you can fill it with a placeholder) (1 line)
df['Cabin'].fillna('Empty',inplace=True)

In [249]:

# Checking the changes 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# Handling Duplicates

In [253]:
# Check for duplicates (1 line)
print(df.duplicated().sum())

# Drop duplicates if any (1 line)
df.drop_duplicates()
df.duplicated().sum()

0

np.int64(0)

# Handling Outliers

In [254]:
import numpy as np

# Function to remove outliers using the IQR method
def remove_outliers(df, column):
    Q1 = df[column].quantile(0.25)
    Q3 = df[column].quantile(0.75)
    IQR = Q3 - Q1
    lower_bound = Q1 - 1.5 * IQR
    upper_bound = Q3 + 1.5 * IQR
    return df[(df[column] >= lower_bound) & (df[column] <= upper_bound)]

# Remove outliers from 'Fare' using the remove_outilers function (1 line)
df = remove_outliers(df,'Fare')

# Scaling and Normalization

In [255]:
scaler = StandardScaler()
df['Fare_scaled'] = scaler.fit_transform(df[['Fare']])

C:\Users\anees\AppData\Local\Temp\ipykernel_21152\3363479160.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Fare_scaled'] = scaler.fit_transform(df[['Fare']])

In [256]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_scaled
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,Empty,S,-0.779117
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,Empty,S,-0.729373
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2.599828
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,Empty,S,-0.720161
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,Empty,Q,-0.690071

In [215]:
from sklearn.preprocessing import StandardScaler, MinMaxScaler

# Standard scaling for 'Fare' (2 lines)
#dfs = pd.DataFrame(df)

dfr = df[['Fare']]
scaler = StandardScaler()
Standard_df = pd.DataFrame(scaler.fit_transform(df[['Fare']]), columns=dfr.columns)
print(Standard_df)


# Min-Max scaling for 'Age' (2 lines)

dfo = df[['Age']]
scalerm = MinMaxScaler()
maxmin_df = pd.DataFrame(scalerm.fit_transform(dfo),columns=dfo.columns)
print(maxmin_df)

#df1 = df
#df1.drop('Name')
#df1.drop('Name',axis=1,inplace=True)



#df1.head()
#df.head()

         Fare
0   -0.502445
1    0.786845
2   -0.488854
3    0.420730
4   -0.486337
..        ...
886 -0.386671
887 -0.044381
888 -0.176263
889 -0.044381
890 -0.492378

[891 rows x 1 columns]
          Age
0    0.271174
1    0.472229
2    0.321438
3    0.434531
4    0.434531
..        ...
886  0.334004
887  0.233476
888       NaN
889  0.321438
890  0.396833

[891 rows x 1 columns]

In [224]:
df['Age_Scaled'] = scalerm.fit_transform(df[['Age']])
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_scaled,Age_Scaled
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,Empty,S,-0.502445,0.271174
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0.786845,0.472229
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,Empty,S,-0.488854,0.321438
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0.420730,0.434531
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,Empty,S,-0.486337,0.434531
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,Empty,S,-0.386671,0.334004
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,-0.044381,0.233476
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,Empty,S,-0.176263,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,-0.044381,0.321438
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Empty,Q,-0.492378,0.396833

# Encoding Categorical Variables

In [172]:
# One-hot encoding for 'Embarked' and 'Sex' (1 line)
dfo = df[['Embarked', 'Sex']]
onehot = pd.get_dummies(dfo,columns=dfo.columns)
onehot.head(2)

   Embarked_C  Embarked_Q  Embarked_S  Sex_female  Sex_male
0       False       False        True       False      True
1        True       False       False        True     False